{
    "parts": [
        {
            "name": "Admiral Dishwasher Upper Rack Adjuster Kit",
            "part_number": "PS10065979",
            "manufacturer_part_number": "W10712395",
            "description": "This authentic Dishwasher Upper Rack Adjuster Kit with white wheels is a kit made up of primarily plastic and metal components, which will require a screwdriver to install. This kit comes with all the necessary parts for a dishwasher rack adjuster. It fits onto the dishwasher rack and connects it to the track allowing it to slide in and out. If broken then the rack will no longer slide properly, and the part must be replaced. In many cases, our customers have reported the top rack of their dishwasher hanging down or sagging due to the adjuster kit, particularly if the wheels have broken or failed. If you are having problems in this area, this kit will help get your dishwasher back up and running. Check your model number and user manual to see if this part is right for you. The parts for this kit come as a package and are not generally sold individually."
        },
        {
            "name": "Admiral Dishwasher Rack Track Stop",
            "part_number": "PS11746591",
            "manufacturer_part_number": "WP8565925",
            "description": "The rack track stop on your dishwasher is designed to stop the dish rack at the appropriate place when opening and closing the rack. If your dishwasher is not cleaning your dishes properly, the rack stop may need to be replaced. The replacement part may differ slightly from the broken part, depending on the model. However, the different styles are interchangeable. This product is sold individually and comes in both a white and grey plastic version. Many of our customers found this repair to be very easy and takes less than 30 minutes to complete. Simply snap the old part out and snap the new part into place. You will not require any tools to complete the job. This is an authentic part approved by the manufacturer."
        },
        {
            "name": "Admiral Dishwasher Heating Element",
            "part_number": "PS8260087",
            "manufacturer_part_number": "W10518394",
            "description": "This manufacturer-certified heating element is used to create heat during the dry cycle and increase water temperature during portions of the wash cycle when certain options are selected. If your dishes are not drying or the water in the dishwasher is not getting hot you may need to replace the element. This kit includes the heater, two heater fasteners, and is a genuine OEM part. Please remember to disconnect the power before starting the repair. Use a multi-meter to test your heating element for continuity to determine whether this is the part that is causing your symptom. This part does not include any washers. To make your repair, disconnect the wires from the bottom of the element in the back, remove the plastic nuts holding it in place, remove the element, and repeat these steps in reverse order to install your new part. This is an easy repair that requires only a screwdriver, wrench set, and should take less than 30 minutes."
        },
        {
            "name": "Admiral Dishwasher Mounting Bracket",
            "part_number": "PS11745496",
            "manufacturer_part_number": "WP8269145",
            "description": "The mounting bracket is sold individually, without screws. This part secures the upper side of the dishwasher to the underside of the counter or cabinet to prevent the dishwasher from moving, shaking, or tilting forward. The bracket is made entirely of metal. It is recommended to check all brackets, if applicable, because they often wear at the same rate and both may need to be replaced. This is an OEM part that is sourced from the authentic manufacturer. Tools needed are a pair of needle nose pliers and a screwdriver."
        },
        {
            "name": "Admiral Dishwasher Door Gasket",
            "part_number": "PS16221222",
            "manufacturer_part_number": "W11498831",
            "description": "This door gasket is a genuine OEM replacement part that is specially designed for your dishwasher. The gasket is located around the frame of the dishwasher. It is a rubber seal that helps prevent water from leaking out of the dishwasher during the wash cycle. It also helps to absorb the noise and vibrations created while the dishwasher is running. Over time the gasket may wear down, tear, or fall off due to exposure to heat and chemicals. If the gasket can no longer create a watertight seal, it is best to replace it promptly to keep your dishwasher running efficiently and to prevent potential accidents."
        },
        {
            "name": "Admiral Dishwasher Positioner",
            "part_number": "PS11750093",
            "manufacturer_part_number": "WPW10195840",
            "description": "Also known as rack adjuster. Sold individually. This is an original part from KitchenAid, Kenmore, Whirlpool, Jenn-Air, and Maytag for use with Dishwashers. The dishrack adjuster arm positioner clip holds the adjuster arm in the right position on the dishrack. The most common reason for replacing the strap is if the rack will not stay in its desired position. This part is sold individually. There are no tools needed to replace the positioner."
        },
        {
            "name": "Admiral Dishwasher Friction Sleeve",
            "part_number": "PS11745488",
            "manufacturer_part_number": "WP8268961",
            "description": "This part helps to keep your door quiet when it opens and closes."
        },
        {
            "name": "Admiral Dishwasher Middle Spray Arm",
            "part_number": "PS11755664",
            "manufacturer_part_number": "WPW10498900",
            "description": "This is a replacement middle spray arm in your dishwasher. You will find your middle spray arm mounted on the bottom of the middle dish rack. The upper spray arm rotates and sprays water during the operating cycle. If your dishes are not coming out of the dishwasher clean, you may have a malfunctioning middle spray arm. Debris and hard water buildup in your dishwasher can cause the middle spray arm to clog. To replace the spray arm, simply turn the arm counter clockwise to release it from the dish rack. Screw in the new spray arm to complete the repair. This part is sold individually."
        },
        {
            "name": "Admiral Dishwasher Filter",
            "part_number": "PS11759673",
            "manufacturer_part_number": "W10872845",
            "description": "This filter works with the water pump in your dishwasher. It prevents debris from entering the pump and causing damage. As a result, the filter can occasionally become clogged or damaged, and will need to be replaced. A good indication of a damaged filter is if your dishwasher is not draining or cleaning the dishes properly. This filter has a gray plastic top and bottom that are approximately 5 inches in diameter. This is a genuine OEM part that comes directly from the manufacturer. To replace the filter, simply turn it counterclockwise to unlock, and then screw in the new filter"
        },
        {
            "name": "Admiral Dishwasher Lower Spray Arm",
            "part_number": "PS11755592",
            "manufacturer_part_number": "WPW10491331",
            "description": "This is a lower spray arm for a dishwasher. The lower spray arm allows water to be spread evenly throughout the dishwasher tub with the proper force so dishes come out clean. This spray arm is gray in color and is about 20 inches long. You may need to replace this part if the water is not being distributed."
        }
    ]
}
